{"posts":[{"title":"Bienvenue !","text":"Hello friends! Welcome to my personal website! I’m Haoyu Zhu (Jules). I study algebra, for example, Cluster Algebra, Lie Algebra, Algebraic Number Theory, and Geometric Algebra. I am also interested in analysis and geometry. I can speak Chinese and a little English. I’m also learning French at the moment. I owe my great thanks to the professor who introduced me to algebra: Huang Min. Coucou les amis! Bienvenue à mon Site Web Personnel! Moi, c’est Jules. J’étudie l’algèbre, par exemple, Algèbre Amassée, Algèbre de Lie, Théorie des Nombres Algébriques et Algèbre Géométrique. Je m’intéresse aussi à l’analyse et à la géométrie. Je peux parler chinois et un peu anglais. J’apprends aussi le français en ce moment. C’est mon professeur qui m’a introduit à l’algèbre: Huang Min.","link":"/2025/03/07/Bienvenue/"},{"title":"homework_test","text":"Homework 1","link":"/2025/03/09/Diff_Geo_HW_1/"},{"title":"CV","text":"Haoyu ZhuEmail: zhuhy86@mail2.sysu.edu.cn Download my CV (last updated at Feb. 2025) Education Background Undergraduate, School of Mathematics (Zhuhai), Sun Yat-sen University, Zhuhai (2022 – present) Expected date of graduation: June 2026 CoursesCommutative Algebra (Graduate) (Feb 2024 – Jun 2024) Textbook: Introduction to Commutative Algebras, M.F. Atiyah, I.G. Macdonald. Instructor: Prof. Lei Zhang. Grade point: 77/100. Representation Theory (Graduate) (Feb 2024 – Jun 2024) Textbook: Introduction to Lie Algebras and Representation Theory, J.E. Humphreys. Instructor: Prof. Min Huang. Grade point: 96/100. Real Analysis (Graduate) (Sept 2024 – Jan 2025) Textbook: Measure Theory and Fine Properties of Functions, L.C. Evans, R.F. Gariepy. Instructor: Prof. Xining Li. Grade point: 85/100. Selected Topics in Number Theory (Graduate) (Feb 2025 – present) Textbook: A Classical Introduction to Modern Number Theory, Kenneth Ireland, Michael Rosen. Instructor: Prof. Chan Ieong Kuan. Complex Analysis (Feb 2025 – present) Textbook: Real and Complex Analysis, Walter Rudin. Instructor: Prof. Jujie Wu. Algebraic Geometry(Seminar) (Feb 2025 – present) Textbook: Algebraic Geometry, Hartshorne. Mentor: Prof. Lei Zhang. Speakers: Si’an Huang, Wenyi Zhou, etc. Research ExperienceCollege Students’ Innovative Entrepreneurial Training Plan Program (Oct 2023 – Oct 2024) Institution: Sun Yat-sen University, Zhuhai. Summary: Read Stembridge’s paper on Immanants and worked on problems involving integer partitions and irreducible characters of symmetric groups. Advisor: Prof. Min Huang. PKU Algebraic Combinatorics Experience (Jul 2024 – Aug 2024) Institution: Peking University, Peking. Summary: On Bott–Samelson rings for Coxeter groups. One can see arxiv.org/abs/2408.10155 for details. Advisor: Dr. Tao Gui. Collaborators: Lin Sun, Shihao Wang. College Students’ Innovative Entrepreneurial Training Plan Program (Oct 2024 – present) Institution: Sun Yat-sen University, Zhuhai. Summary: Comparing skein algebras and quantum cluster algebras of certain semisimple Lie algebras. Advisor: Prof. Min Huang. Skills Programming languages: Python, MATLAB, SageMath, LaTeX. Honors and Awards 2023: Third Prize Scholarship. 2024: Excellent Student Cadre.","link":"/2025/03/09/CV/"}],"tags":[{"name":"cv","slug":"cv","link":"/tags/cv/"}],"categories":[{"name":"homework","slug":"homework","link":"/categories/homework/"},{"name":"cv","slug":"cv","link":"/categories/cv/"},{"name":"Classical Differential Geometry","slug":"homework/Classical-Differential-Geometry","link":"/categories/homework/Classical-Differential-Geometry/"},{"name":"Week 2 (03&#x2F;09)","slug":"homework/Classical-Differential-Geometry/Week-2-03-09","link":"/categories/homework/Classical-Differential-Geometry/Week-2-03-09/"}],"pages":[{"title":"cv","text":"","link":"/cv/index.html"},{"title":"homework","text":"","link":"/homework/index.html"}]}