{"posts":[{"title":"Bienvenue !","text":"Coucou les amis ! Bienvenue à mon Site Web Personnel ! Moi, c’est Jules. J’étudie l’algèbre, par exemple, Algèbre Amassée, Algèbre de Lie, Théorie Algébrique des Nombres et Algèbre Géométrique. Je m’intéresse aussi à l’analyse et à la géométrie. Je peux parler chinois et un peu anglais. J’apprends aussi le français en ce moment. C’est mon professeur qui m’a introduit à l’algèbre: Huang Min. Hello everyone, my name is ZHU Haoyu, and I am currently a third-year undergraduate student majoring in mathematics. My journey in algebra began in my sophomore year with an introduction to group theory, ring theory, and a bit of field theory. In the following semester, I studied commutative algebra and representation theory, including Lie algebras and an introduction to Coxeter groups. More recently, I explored cluster algebras, their connections to quiver representations and cluster categories, and the theory of quantum cluster algebras, under the instruction of professor Huang Min. I am eager to engage with cutting-edge research. Last summer, I collaborated with researchers at Peking University on Bott–Samelson rings for Coxeter groups. We provided explicit presentations of these rings using generators and relations and discovered interesting combinatorial properties. Currently, I am studying the correspondence between skein algebras and quantum cluster algebras of $\\mathfrak{sl_2}$, aiming to extend these results to stated skein algebras and other semisimple Lie algebras. I enjoy learning mathematics with others. Hosting and participating in seminars allows me to exchange ideas with peers, as I believe discussion and collaboration are key to deepening our understanding and gaining new insights. Thank you!2025/03/02","link":"/2025/03/07/Bienvenue/"},{"title":"CV","text":"Haoyu ZhuEmail: zhuhy86@mail2.sysu.edu.cn Download my CV (last updated at Feb. 2025) Education Background Undergraduate, School of Mathematics (Zhuhai), Sun Yat-sen University, Zhuhai (2022 – present) Pause for illness: 2025-2026 Expected date of graduation: June 2027 CoursesCommutative Algebra (Graduate) (Feb 2024 – Jun 2024) Textbook: Introduction to Commutative Algebras, M.F. Atiyah, I.G. Macdonald. Instructor: Prof. Lei Zhang. Grade point: 77/100. Representation Theory (Graduate) (Feb 2024 – Jun 2024) Textbook: Introduction to Lie Algebras and Representation Theory, J.E. Humphreys. Instructor: Prof. Min Huang. Grade point: 96/100. Real Analysis (Graduate) (Sept 2024 – Jan 2025) Textbook: Measure Theory and Fine Properties of Functions, L.C. Evans, R.F. Gariepy. Instructor: Prof. Xining Li. Grade point: 85/100. Algebraic Geometry(Seminar) (Feb 2025 – present) Textbook: Algebraic Geometry, Hartshorne. Mentor: Prof. Lei Zhang. Speakers: Si’an Huang, Wenyi Zhou, etc. Research ExperienceCollege Students’ Innovative Entrepreneurial Training Plan Program (Oct 2023 – Oct 2024) Institution: Sun Yat-sen University, Zhuhai. Summary: Read Stembridge’s paper on Immanants and worked on problems involving integer partitions and irreducible characters of symmetric groups. Advisor: Prof. Min Huang. PKU Algebraic Combinatorics Experience (Jul 2024 – Aug 2024) Institution: Peking University, Peking. Summary: On Bott–Samelson rings for Coxeter groups. One can see arxiv.org/abs/2408.10155 for details. Advisor: Dr. Tao Gui. Collaborators: Lin Sun, Shihao Wang. College Students’ Innovative Entrepreneurial Training Plan Program (Oct 2024 – present) Institution: Sun Yat-sen University, Zhuhai. Summary: Comparing skein algebras and quantum cluster algebras of certain semisimple Lie algebras. Advisor: Prof. Min Huang. Skills Programming Languages: Python, MATLAB, SageMath, {LaTeX}. Languages: 简体中文/普通话 (native) &gt; English (B2/C1) &gt; Français (A2/B1) Honors and Awards 2023: Third Prize Scholarship. 2024: Excellent Student Cadre.","link":"/2025/03/09/CV/"},{"title":"","text":"Vidéo 1: Lalaland, 2024 avec Zhile Hemp4: Lalaland Your browser does not support the video tag. Vidéo 2: 那天一个冲动, 2024 avec 中珠合唱团mp4: 那天一个冲动 Your browser does not support the video tag.","link":"/2025/07/29/Chorale/"},{"title":"团长面试","text":"一面pdftex 二面（群面）","link":"/2025/07/29/Interview/"},{"title":"Devoirs de français","text":"Ça y est! J’ai fini mes devoirs!Devoir 1:PDFIl y a deux diaglogues. Je lui fait avec Emma, qui est une master de département de Philosophie (Zhuhai). Devoir 2:","link":"/2025/03/18/devoir-1/"},{"title":"Sèries Françaises","text":"01 Les Grandes Grandes VacancesLes Grandes Grandes Vacances est une série animée diffusée en 2015 sur France 3, qui raconte la Seconde Guerre mondiale et l’occupation à hauteur d’enfants. Citations On sera libre. Vive la France! 02 Tobie Lolness02 Tobie Lolness a onze ans, il mesure un millimètre et demi, et vit heureux dans l’Arbre avec ses parents. Mais aujourd’hui, il doit fuir, seul. Le père de Tobie, savant génial et sage, a refusé de livrer le secret d’une invention révolutionnaire qui permet de transformer la sève de l’arbre en énergie motrice. Il sait que certains s’en serviraient au détriment de l’arbre… Mais un homme, Jo Mitch, est prêt à tout pour récupérer cette découverte. Il retourne la population de l’Arbre contre la famille Lolness, fait emprisonner les parents et lance une gigantesque chasse à l’homme contre Tobie auquel son père a confié le secret de son invention. Tobie, poursuivi par tout son peuple, s’enfuit vers les Basses-Branches, région sauvage de l’Arbre. Mais son périple le conduit bien au-delà, dans la Prairie, là où vivent les Pelés que tout le monde craint et déteste. Pourtant Tobie devient un des leurs, et renaît. Il peut dès lors retourner sauver ceux qu’il aime, son peuple et l’Arbre lui-même. Citations La liberte ou la mort. (S1 E16 - Bûcheron 505 - Partie 1) L’herbe est fragile, mais elle repousse. (19:30:00, S1 E26 - L’herbe est fragile - Partie 2) Nous sommes loin, mais nous sommes proches. (S1 E26) Quand on vit dans un monde si beau, il faut marcher sur la pointe des pieds. Comme si nous étions des géants. Le moindre de nos pas fait trembler le monde. (S1 E26)","link":"/2025/03/15/S%C3%A9ries%20Fran%C3%A7aises/"},{"title":"Number Theory HW1","text":"3.06Exercise 1.1, 1.3, 1.16, 1.21, 1.23Exercise 2.10, 2.12, 2.22, 2.25, 2.26 3.20Exercise 3.17-3.21Exercise 4.6, 4.11Exercise 5.11, 5.29-5.31 4.3Exercise 6.10, 6.15Exercise 7.8, 7.15Exercise 8.1, 8.2 4.22Exercise 8.21, 8.2Exercise 9.19, 9.33-9.37 5.8Exercise 10.7-10.9, 10.23, 10.27Exercise 11.9, 11.17 This is my homework:HW1: pdf, texHW2: pdf, tex","link":"/2025/03/12/NT-HW/"},{"title":"Complex integration and the homotopy version of Cauchy’s theorem","text":"are , (with endpoints fixed),in the fixed endpoint case:; or in the closed case:. , if is closed in which is homotopic to a point, thenThis is the case if is the boundary of a subregion such that is to a closed disk. We first introduce some embedding and approximation theorems. Let be a and let be a function. Given any positive function , there exists a function that is close to . Let be , and let be a map. Then is homotopic to a map . If are homotopic smooth maps, then they are If is homotopic to relative to some closed subset , then they are smoothly homotopic relative to . By virtue of these properties of homotopy, one can apply Stoke’s Theorem which demands both , the oriented dimensional manifold with boundary, and , the compactly supported form on , are smooth. : such that .: . : a closed covector field on a smooth manifold . Then every has a neighborhood on which is exact. Now follows naturally the proof in page 21.","link":"/2025/03/10/Cauchy's%20Theorem%20(Homotopic%20Version)/"},{"title":"homework_algebraic_geometry","text":"sheaf and schemeHartshorne: GTM52ii.1: 1.2, 1.3, 1.7, 1.9, 1.10, 1.12, 1.14, 1.21, 1.22Atiyah: CAChapter 2: direct sum.","link":"/2025/03/09/Alg_Geo_HW_1/"},{"title":"&#39;homework_func_analysis&#39;","text":"","link":"/2025/03/09/Func_Aly_HW_1/"},{"title":"Differential Geometry","text":"Homework 1","link":"/2025/03/09/Diff_Geo_HW_1/"}],"tags":[{"name":"cv","slug":"cv","link":"/tags/cv/"}],"categories":[{"name":"homework","slug":"homework","link":"/categories/homework/"},{"name":"cv","slug":"cv","link":"/categories/cv/"},{"name":"algebraic geometry","slug":"homework/algebraic-geometry","link":"/categories/homework/algebraic-geometry/"},{"name":"week 2","slug":"homework/algebraic-geometry/week-2","link":"/categories/homework/algebraic-geometry/week-2/"},{"name":"note","slug":"note","link":"/categories/note/"},{"name":"Music","slug":"Music","link":"/categories/Music/"},{"name":"functional analysis","slug":"homework/functional-analysis","link":"/categories/homework/functional-analysis/"},{"name":"Number Theory","slug":"homework/Number-Theory","link":"/categories/homework/Number-Theory/"},{"name":"complex analysis","slug":"note/complex-analysis","link":"/categories/note/complex-analysis/"},{"name":"séries","slug":"series","link":"/categories/series/"},{"name":"Devoirs de Français","slug":"homework/Devoirs-de-Francais","link":"/categories/homework/Devoirs-de-Francais/"},{"name":"Chorus","slug":"Music/Chorus","link":"/categories/Music/Chorus/"},{"name":"Classical Differential Geometry","slug":"homework/Classical-Differential-Geometry","link":"/categories/homework/Classical-Differential-Geometry/"},{"name":"week 2","slug":"homework/functional-analysis/week-2","link":"/categories/homework/functional-analysis/week-2/"},{"name":"Xu Hang","slug":"note/complex-analysis/Xu-Hang","link":"/categories/note/complex-analysis/Xu-Hang/"},{"name":"french","slug":"series/french","link":"/categories/series/french/"},{"name":"Week 2 (03&#x2F;09)","slug":"homework/Classical-Differential-Geometry/Week-2-03-09","link":"/categories/homework/Classical-Differential-Geometry/Week-2-03-09/"}],"pages":[{"title":"cv","text":"","link":"/cv/index.html"},{"title":"homework","text":"","link":"/homework/index.html"}]}